[
    {
        "name": "Jarden R",
        "body": "I signed up with Ramesh for 12 weeks of hypertrophy training to focus more on upper body strength.  I've never had a coach who's been so professional, supportive and knowledgeable.  He's a good listener and clearly understood my goals and timeframes from Day 1. His ability to change up the exercise routine every few weeks enabled me to focus on key areas for muscle gain and increase my lifting weight progressively. I gained considerable improvement in strength in my shoulders, arms and chest, plus strengthened my core at the same time.  I would've continued with Ramesh if not for my post-graduate studies. 👍"
    },
    {
        "name": "Liam C",
        "body": "Ramesh certainly helped me rebuild my enthusiasm for the gym after a 5-year layoff and build my confidence and self-esteem. His twice-weekly sessions were customised to my preferences, always energising and enabled me to train safely.  I lost 6.5kg while training with Ramesh through good nutritional advice (including a supermarket aisle walk!).  Very grateful to him for kickstarting me on my fitness journey."
    },
    {
        "name": "Sam M",
        "body": "This man is an amazing fitness and lifestyle coach! A very friendly and understanding person who seems genuinely interested in his clients.  Besides weights training, he was a big help in improving my lifestyle choices like eating habits, sleep and stress management. I really appreciated his weekly check-ins via text messages.  A super caring PT who knows how to get sustainable results. 💪"
    },
    {
        "name": "Kiran K",
        "body": " After training with Ramesh, my posture and full body strength improved, but I also mastered the technique and form for lifting weights. Through careful selection of cardio and HIIT programs plus weight training using dumbbells/kettlebells, Ramesh closely monitored my progress and provided strong motivation for me to hit my fitness goals. Once I'm back from my overseas trip, I'll definitely resume my sessions with him. A+"
    },
    {
        "name": "Dylan M",
        "body": "I’ve been training with Ramesh for 12 weeks now and I’m already seeing great results. He’s knowledgeable, listens to my goals, and adapts the workouts to keep me challenged. His training approach is solid and I feel like I’m making steady progress. I’d definitely recommend him to anyone looking for a dedicated trainer who is passionate about getting results." 
    }
]